java中：
对象(object) 引用: 以我的理解，java中的对象是来连接java程序的运行的，通过对象之间的引用，在java中称之为引用，其实就是调用，同时在引用过程中所指向分配给的内存地址。
类(class)：类应该就相当于一个小队，每个小队有自己的成员，当然这些小队可以是从别的队继承过来的，相互渗透。
引用
继承(extends)：类的继承，就是把自己的东西留给后代，比如属性、方法。但是当某些标识符存在之后，就不一定全部留给后代了。
方法()：方法就相当于其他语言中的函数function，调用方法就是调用函数，用来完成某一个动作、目标等。
构造方法(public classname)：又称构造器。java中任何变量在被使用时都必须设置初始值。构造方法就是java专门为类的成员变量赋初值，构造方法会在对象被实例化的时候调用。
                          其实是不是可以这样子理解，
                          每当类创建对象的时候，都通过构造方法来进行。但是构造方法名必须和类名一致；构造方法没有返回型类型，就是相当于一个声明，也不用返回，连void也没有。
                          如果一个类中没有定义构造方法，java会自动提供一个没有任何形参的默认构造方法，如：public classname(){} 有参数的构造方法如 public classname(arg1,arg2...){}
                          大括号内也是可以存在一些表达式的。
构造方法重载:就是可以直接在进行一次构造方法，可以是不同的，比如在构造的时候多添加一个形参。
普通方法重载
访问修饰符

接口(implements):
抽象类(abstract)
实现
抽象方法
this关键字
super关键字
自动转型
强制转型
